In [24]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import r2_score, mean_absolute_error, mean_squared_error

## Based on historical data ,we are going to predict if the user would purche SUV vehicle or not

In [35]:
# Importing the dataset
df = pd.read_csv("suv.csv")

In [36]:
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [37]:
#Checking the shape of dataset
df.shape

(400, 5)

This is not a huge dataset, which is having just 400 rows and 5 columns

Here are few statistics observed:/n
Age: Average age of users in our dataset is 37.6 years, minimum age is 18 years old and even there are users of maximum age 60.
Salary: Average salary from the dataset provided is 69700, where the minimum slary is 15000 and maximum salary is 150000.
Purchased: By above stats, we can say that all the suv's are bought by users who are above the age of 46 years. So probably, SUV's are not attarcting users who are aged less then 46

In [39]:
df.isnull().sum()

User ID            0
Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

There are no null values in the dataset

In [40]:
df1 = pd.get_dummies(df)
df1

      User ID  Age  EstimatedSalary  Purchased  Gender_Female  Gender_Male
0    15624510   19            19000          0              0            1
1    15810944   35            20000          0              0            1
2    15668575   26            43000          0              1            0
3    15603246   27            57000          0              1            0
4    15804002   19            76000          0              0            1
..        ...  ...              ...        ...            ...          ...
395  15691863   46            41000          1              1            0
396  15706071   51            23000          1              0            1
397  15654296   50            20000          1              1            0
398  15755018   36            33000          0              0            1
399  15594041   49            36000          1              1            0

[400 rows x 6 columns]

In [41]:
df1.corr()

,User ID,Age,EstimatedSalary,Purchased,Gender_Female,Gender_Male
User ID,1.000000,-0.000721,0.071097,0.007120,0.025249,-0.025249
Age,-0.000721,1.000000,0.155238,0.622454,0.073741,-0.073741
EstimatedSalary,0.071097,0.155238,1.000000,0.362083,0.060435,-0.060435
Purchased,0.007120,0.622454,0.362083,1.000000,0.042469,-0.042469
Gender_Female,0.025249,0.073741,0.060435,0.042469,1.000000,-1.000000
Gender_Male,-0.025249,-0.073741,-0.060435,-0.042469,-1.000000,1.000000

In [42]:
df1.describe()

,User ID,Age,EstimatedSalary,Purchased,Gender_Female,Gender_Male
count,4.000000e+02,400.000000,400.000000,400.000000,400.000000,400.000000
mean,1.569154e+07,37.655000,69742.500000,0.357500,0.510000,0.490000
std,7.165832e+04,10.482877,34096.960282,0.479864,0.500526,0.500526
min,1.556669e+07,18.000000,15000.000000,0.000000,0.000000,0.000000
25%,1.562676e+07,29.750000,43000.000000,0.000000,0.000000,0.000000
50%,1.569434e+07,37.000000,70000.000000,0.000000,1.000000,0.000000
75%,1.575036e+07,46.000000,88000.000000,1.000000,1.000000,1.000000
max,1.581524e+07,60.000000,150000.000000,1.000000,1.000000,1.000000

Here are few statistics observed:
Age: Average age of users in our dataset is 37.6 years, minimum age is 18 years old and even there are users of maximum age 60. Salary: Average salary from the dataset provided is 69700, where the minimum slary is 15000 and maximum salary is 150000. Purchased: By above stats, we can say that all the suv's are bought by users who are above the age of 46 years. So probably, SUV's are not attarcting users who are aged less then 46.
Gender: Women are slightly more intersted to buy SUV's compared to men.

In [44]:
X = df1.loc[: ,['Age', 'EstimatedSalary', 'Gender_Female','Gender_Male' ]]
y = df[['Purchased']]

In [45]:
X_train, X_test, y_train, y_test = train_test_split(X,y,train_size=0.8)

In [46]:
model=LogisticRegression()

In [47]:
model.fit(X_train,y_train)

C:\Users\Personal Machine\anaconda3\lib\site-packages\sklearn\utils\validation.py:63: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(*args, **kwargs)

LogisticRegression()

In [48]:
y_regression = model.predict(X_test)
y_regression

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], dtype=int64)

In [18]:
y_test

     Purchased
155          0
204          1
241          0
92           0
179          0
..         ...
134          0
286          0
118          0
166          0
339          1

[80 rows x 1 columns]

In [49]:
r2_score(y_test,y_regression)

-0.5094339622641506

In [50]:
mean_absolute_error(y_test,y_regression)

0.3375

In [51]:
mean_squared_error(y_test,y_regression)

0.3375

## Feature Scaling

In [52]:
from sklearn.preprocessing import StandardScaler

In [53]:
sc = StandardScaler()

In [55]:
X_train = sc.fit_transform(X_train)
X_test = sc.fit_transform(X_test)

In [56]:
model.fit(X_train,y_train)

C:\Users\Personal Machine\anaconda3\lib\site-packages\sklearn\utils\validation.py:63: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(*args, **kwargs)

LogisticRegression()

In [57]:
y_regression = model.predict(X_test)
y_regression

array([1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0,
       0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0,
       1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0,
       1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1], dtype=int64)

In [58]:
y_test

     Purchased
352          1
358          1
290          1
396          1
37           0
..         ...
349          0
323          1
398          0
14           0
264          1

[80 rows x 1 columns]

In [59]:
r2_score(y_test,y_regression)

0.5527603074772887

In [60]:
mean_absolute_error(y_test,y_regression)

0.1

In [61]:
mean_squared_error(y_test,y_regression)

0.1

In [62]:
from sklearn.metrics import accuracy_score

In [64]:
accuracy_score(y_test, y_regression)

0.9